ltcmweb/seedsigner-micropython-builder/ports/esp32/board_common/boards/qemu/sdkconfig.defaults
# QEMU
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=n
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=n
CONFIG_SPIRAM_MODE_OCT=n
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FATFS_SECTOR_512=y
CONFIG_FATFS_LFN_HEAP=y

# SPI display requires ISR in IRAM so SPI transaction interrupts are not
# blocked by flash cache misses. Without this, display DMA from SPIRAM fails.
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# Disable power management: PM clock gating can scale down APB clock and
# gate SPI peripheral clocks, causing display transactions to fail.
CONFIG_PM_ENABLE=n

# Route console to USB-Serial/JTAG (the only USB connection on this board).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
